module.exports = {
  layerReverse: {
    '负五层': -5,
    '负四层': -4,
    '负三层': -3,
    '负二层': -2,
    '负一层': -1,
    '一层': 1,
    '二层': 2,
    '三层': 3,
    '四层': 4,
    '五层': 5,
    '六层': 6,
    '七层': 7,
    '八层': 8,
    '九层': 9,
    '十层': 10,
    '阁楼': 10000
  },
  referenceTypeReverse: {
    '当前格局是参考图的改户型': 'CHANGE_LAYOUT',
    '当前格局是参考图的反户型': 'REVERSE_LAYOUT',
    '当前格局是参考图的近似户型': 'SIMILAR_LAYOUT',
  },
  floorArray: ['负五层', '负四层', '负三层', '负二层', '负一层', '一层', '二层', '三层', '四层', '五层', '六层', '七层', '八层', '九层', '十层', '阁楼'],
  referTypeArray: ['当前格局是参考图的改户型', '当前格局是参考图的反户型', '当前格局是参考图的近似户型']
}
